res/cf/Catalogs/Контуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеКонтура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтура</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтуров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/Enums/ТипыКонтуров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтуров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продуктив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тестирование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

res/cf/Catalogs/Контуры/Ext/ManagerModule.bsl
Процедура ПодготовитьПредопределенныеЭлементы() Экспорт
	
	// первичное заполнение предопределенных элементов
	ПрототипСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Контуры.Продуктив");
	ПрототипОбъект = ПрототипСсылка.ПолучитьОбъект();
	ПрототипОбъект.ОписаниеКонтура = "Рабочие базы";
	ПрототипОбъект.ТипКонтура = Перечисления.ТипыКонтуров.Продуктив;
	ПрототипОбъект.Записать();
	
	ПрототипСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Контуры.НочныеКопии");
	ПрототипОбъект = ПрототипСсылка.ПолучитьОбъект();
	ПрототипОбъект.ОписаниеКонтура = "Ночные копии рабочих баз";
	ПрототипОбъект.ТипКонтура = Перечисления.ТипыКонтуров.Тестирование;
	ПрототипОбъект.Записать();
	
	ПрототипСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Контуры.Предрелиз");
	ПрототипОбъект = ПрототипСсылка.ПолучитьОбъект();
	ПрототипОбъект.ОписаниеКонтура = "Предрелизные копии рабочих баз";
	ПрототипОбъект.ТипКонтура = Перечисления.ТипыКонтуров.Тестирование;
	ПрототипОбъект.Записать();
	
	ПрототипСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Контуры.Разработка");
	ПрототипОбъект = ПрототипСсылка.ПолучитьОбъект();
	ПрототипОбъект.ОписаниеКонтура = "Разработка";
	ПрототипОбъект.ТипКонтура = Перечисления.ТипыКонтуров.Разработка;
	ПрототипОбъект.Записать();
	
КонецПроцедуры

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|  ЗначениеРазрешено(Ссылка)";

КонецПроцедуры
